{
  "add_prefix_space": false,
  "bos_token": "<|endoftext|>",
  "cls_token": "<|cls|>",
  "eos_token": "<|endoftext|>",
  "model_max_length": 1024,
  "name_or_path": "skipformer",
  "pad_token": "<|pad|>",
  "special_tokens_map_file": null,
  "tokenizer_class": "SkipformerTokenizer",
  "unk_token": "<|endoftext|>"
}
