{
  "activation_function": "gelu_new",
  "architectures": [
    "SkipformerLMHeadModel"
  ],
  "attn_pdrop": 0.1,
  "bos_token_id": 50256,
  "cache_dir": "data",
  "embd_pdrop": 0.1,
  "eos_token_id": 50256,
  "in_dim": 768,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "skipformer-a",
  "n_embd": 768,
  "n_head": 12,
  "n_inner": null,
  "n_layer": 12,
  "n_positions": 1024,
  "out_dim": 768,
  "pad_token_id": 50257,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "revision": "main",
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "sep_token_id": 50258,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.25.1",
  "use_auth_token": null,
  "use_cache": true,
  "vocab_size": 50259,
  "window_attention": true
}
